src/extensions/РазличныеДополненияДляБГУ2/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДП</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеРП</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/extensions/РазличныеДополненияДляБГУ2/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/extensions/РазличныеДополненияДляБГУ2/Catalogs/Контрагенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
&ИзменениеИКонтроль("УстановитьВидимостьРеквизитовКонтрагента")
Процедура ИвЦСМ_УстановитьВидимостьРеквизитовКонтрагента()

	Если Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда

		Элементы.РеквизитыЮридическогоЛица.Видимость = Ложь;

		Если ПравоДоступа("Просмотр", Метаданные.Справочники.ФизическиеЛица) Тогда 

			Элементы.РеквизитыФизическогоЛица.Видимость = Истина;

			ЭтоИностранноеФЛ = НЕ (ФизическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") 
			ИЛИ ФизическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.ПустаяСсылка"));

			Элементы.ГруппаРегНомераИностранца.Видимость 			= ЭтоИностранноеФЛ;
			Элементы.ФизическоеЛицоНаименованиеЛатиницей.Видимость 	= ЭтоИностранноеФЛ;

			Элементы.ЗаполнитьПоИННФЛ.Видимость = НЕ ОтобразитьЗаполнениеПоДаннымЕГР 
			И НЕ ЭтоИностранноеФЛ
			И ЗначениеЗаполнено(ФизическоеЛицо.ИНН)
#Удаление
			И ЗначениеЗаполнено(ФизическоеЛицо.ОГРНИП)
#КонецУдаления
			И НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ФизЛицо) = Неопределено;

			Элементы.ФизическоеЛицоНаименование.РедактированиеТекста = НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ФизЛицо) = Неопределено;

		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РеквизитыФизическогоЛица", "Видимость", Ложь);
		КонецЕсли;	

	Иначе

		Элементы.РеквизитыФизическогоЛица.Видимость 	= Ложь;	
		Элементы.РеквизитыЮридическогоЛица.Видимость 	= Истина;

		ЭтоИностраннаяОрганизация = НЕ (ЮридическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") 
		ИЛИ ЮридическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.ПустаяСсылка"));

		Элементы.ГруппаРеквизитыИностраннойОрганизации.Видимость 	=  ЭтоИностраннаяОрганизация;
		Элементы.БюджетныеРеквизиты.Видимость 						= НЕ ЭтоИностраннаяОрганизация;
		Элементы.ПризнакАдминистратораНачислений.Видимость 			= НЕ ЭтоИностраннаяОрганизация;
		Элементы.ЮридическоеЛицоКодОКПО.Видимость 					= НЕ ЭтоИностраннаяОрганизация;

		Элементы.ЗаполнитьПоИНН.Видимость = НЕ ОтобразитьЗаполнениеПоДаннымЕГР 
		И НЕ ЭтоИностраннаяОрганизация
		И НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ЮрЛицо) = Неопределено;

		Элементы.КнопкаЗаполнитьРеквизитыПоНаименованию.Видимость = НЕ ОтобразитьЗаполнениеПоДаннымЕГР 
		И НЕ ЭтоИностраннаяОрганизация
		И НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ЮрЛицо) = Неопределено;

		Элементы.ЮридическоеЛицоНаименование.РедактированиеТекста = НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ЮрЛицо) = Неопределено;

	КонецЕсли;

	Элементы.ГруппаЗаполнениеПоДаннымЕГР.Видимость = ОтобразитьЗаполнениеПоДаннымЕГР; 

	Если НЕ Параметры.Ключ.Пустая() Тогда
		Элементы.ИзменитьВидКонтрагента.Видимость 	= ЗначениеЗаполнено(Объект.ВидКонтрагента) И ДоступныеВидыКонтрагентов.Количество() > 1;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
